 ![png](updated_books_ERD.png)

In [23]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [24]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [25]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [26]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [27]:
q= '''SELECT * FROM authors'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [author_id, author_name, created_at, updated_at]
Index: []

In [28]:
q= '''SELECT * FROM books'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [book_id, title, author_id]
Index: []

In [29]:
q= '''SELECT * FROM favorites'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [book_id, user_id]
Index: []

In [30]:
q= '''SELECT * FROM users'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [user_id, first_name, last_name, email]
Index: []

##Import Data into Notebook

In [31]:
authors = pd.read_csv("DATA/authors - authors.csv")
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [32]:
books = pd.read_csv("DATA/books - books.csv")
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [33]:
favorites = pd.read_csv("DATA/favorites - favorites.csv")
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [34]:
users = pd.read_csv("DATA/users  - users.csv")
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

#Loading Data into Tables

In [35]:
#authors
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,author_id,int,NO,PRI,None,auto_increment
1,author_name,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [36]:
# Checking author's Field names
describe['Field'].values

array(['author_id', 'author_name', 'created_at', 'updated_at'],
      dtype=object)

In [37]:
# Checking dataframe's columns
authors.columns

Index(['id', 'author_name'], dtype='object')

In [38]:
# Rename columns to match SQL table
rename_map = {"id":"author_id"}
authors = authors.rename(rename_map,axis=1)
authors.head(2)

   author_id        author_name
0          1       Stephen King
1          2  F.Scott Fitgerald

In [39]:
# Reviewing SQL table's data types
describe[['Field','Type']]

         Field         Type
0    author_id          int
1  author_name  varchar(45)
2   created_at     datetime
3   updated_at     datetime

In [40]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
engine.execute(q)

In [41]:
authors.to_sql("authors",engine,index=False, if_exists='append')

5

In [42]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,engine)

   author_id        author_name          created_at          updated_at
0          1       Stephen King 2023-12-01 08:19:49 2023-12-01 08:19:49
1          2  F.Scott Fitgerald 2023-12-01 08:19:49 2023-12-01 08:19:49
2          3        Jack London 2023-12-01 08:19:49 2023-12-01 08:19:49
3          4        Jane Austen 2023-12-01 08:19:49 2023-12-01 08:19:49
4          5       Mary Shelley 2023-12-01 08:19:49 2023-12-01 08:19:49

In [43]:
# check the describe again to confirm no changes
q = """DESCRIBE authors;"""
pd.read_sql(q,engine)

,Field,Type,Null,Key,Default,Extra
0,author_id,int,NO,PRI,None,auto_increment
1,author_name,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [44]:
#books
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, engine)
describe

       Field         Type Null  Key Default           Extra
0    book_id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  PRI    None

In [45]:
# Checking describe's Field names
describe['Field'].values

array(['book_id', 'title', 'author_id'], dtype=object)

In [46]:
# Checking dataframe's columns
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [47]:
# Rename columns to match SQL table
rename_map = {"id":"book_id"}
books = books.rename(rename_map,axis=1)
books.head(2)

   book_id        title  author_id
0        1  The Shining          1
1        2           It          1

In [48]:
# Reviewing SQL table's data types
describe[['Field','Type']]

       Field         Type
0    book_id          int
1      title  varchar(45)
2  author_id          int

In [49]:
# Reviewing dataframe's data types
books.dtypes

book_id       int64
title        object
author_id     int64
dtype: object

In [50]:
books.to_sql("books",engine,index=False, if_exists='append')

6

In [51]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,engine)

   book_id                 title  author_id
0        1           The Shining          1
1        2                    It          1
2        3      The Great Gatsby          2
3        4  The Call of the Wild          3
4        5   Pride and Prejudice          4
5        6          Frankenstein          5

In [52]:
# check the describe again to confirm no changes
q = """DESCRIBE books;"""
pd.read_sql(q,engine)

       Field         Type Null  Key Default           Extra
0    book_id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  PRI    None

In [53]:
#users
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default           Extra
0     user_id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [54]:
# Checking describe's Field names
describe['Field'].values

array(['user_id', 'first_name', 'last_name', 'email'], dtype=object)

In [55]:
# Checking dataframe's columns
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [56]:
# Rename columns to match SQL table
rename_map = {"id":"user_id"}
users = users.rename(rename_map,axis=1)
users.head(2)

   user_id first_name last_name            email
0        1       John       Doe     JD@books.com
1        2      Robin     Smith  Robin@books.com

In [57]:
# Reviewing SQL table's data types
describe[['Field','Type']]

        Field         Type
0     user_id          int
1  first_name  varchar(45)
2   last_name  varchar(45)
3       email  varchar(45)

In [58]:
# Reviewing dataframe's data types
users.dtypes

user_id        int64
first_name    object
last_name     object
email         object
dtype: object

In [59]:
users.to_sql("users",engine,index=False, if_exists='append')

3

In [60]:
# confirm the data has been added
q = """SELECT * FROM users;"""
pd.read_sql(q,engine)

   user_id first_name  last_name                 email
0        1       John        Doe          JD@books.com
1        2      Robin      Smith       Robin@books.com
2        3     Gloria  Rodriguez  grodriquez@books.com

In [61]:
# check the describe again to confirm no changes
q = """DESCRIBE users;"""
pd.read_sql(q,engine)

        Field         Type Null  Key Default           Extra
0     user_id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [62]:
#favorites
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, engine)
describe

     Field Type Null  Key Default Extra
0  book_id  int  YES  MUL    None
1  user_id  int  YES  MUL    None

In [63]:
# Checking describe's Field names
describe['Field'].values

array(['book_id', 'user_id'], dtype=object)

In [64]:
# Checking dataframe's columns
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [65]:
# Reviewing SQL table's data types
describe[['Field','Type']]

     Field Type
0  book_id  int
1  user_id  int

In [66]:
# Reviewing dataframe's data types
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

In [67]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     0

In [68]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
engine.execute(q)

In [69]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,engine)

   @@FOREIGN_KEY_CHECKS
0                     0

In [70]:
favorites.to_sql("favorites",engine,index=False, if_exists='append')

7

In [71]:
# confirm the data has been added
q = """SELECT * FROM favorites;"""
pd.read_sql(q,engine)

   book_id  user_id
0        1        1
1        2        1
2        3        1
3        4        2
4        5        2
5        5        3
6        6        3

In [72]:
# check the describe again to confirm no changes
q = """DESCRIBE favorites;"""
pd.read_sql(q,engine)

     Field Type Null  Key Default Extra
0  book_id  int  YES  MUL    None
1  user_id  int  YES  MUL    None

Running Test Query To Verify Data

In [73]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [75]:
q = '''SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.book_id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.user_id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));'''
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1